app/controllers/nerds_controller.rb

SELECT "nerds".* FROM "nerds"
---
  def index
    @nerds = Nerd.all

SELECT "nerds".* FROM "nerds" WHERE "nerds"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @nerd = Nerd.find(params[:id])

INSERT INTO "nerds" ("answer", "created_at", "nameA", "nameB", "question", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["answer", nil], ["created_at", Sat, 27 Jul 2013 02:50:52 UTC +00:00], ["nameA", "Me"], ["nameB", nil], ["question", "How old are you?"], ["updated_at", Sat, 27 Jul 2013 02:50:52 UTC +00:00]]
---
  def create
    @nerd = Nerd.new(params[:nerd])

    respond_to do |format|
      if @nerd.save